# Используем официальный образ Golang как базовый образ
FROM golang:1.23

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы go.mod и go.sum
COPY go.mod go.sum ./

# Загружаем зависимости перед копированием остальных файлов
RUN go mod download

# Копируем остальные файлы приложения внутрь контейнера
COPY . .

# Изменяем права доступа к файлу конфигурации
RUN chmod 777 /app/config/config.yaml

# Устанавливаем рабочую директорию для сборки приложения
WORKDIR /app/cmd/diplom

# Собираем приложение
RUN go build -o diplom .

# Указываем порт, который будет использоваться приложением
EXPOSE 8080

# Команда для запуска приложения при старте контейнера
CMD ["./diplom"]